Процедура ЗаполнитьПредопределенныеНаселенныеПункты() Экспорт
	
	ГородМосква = ПредопределенноеЗначение("Справочник.НаселенныеПункты.Москва");

	Если ГородМосква.НачальноеЗаполнение Тогда
		Возврат;
	КонецЕсли; 
	
	НаселенныеПункты = ПолучитьОбщийМакет("НаселенныеПункты");
	ОбластьМосква = НаселенныеПункты.ПолучитьОбласть("Москва");
	
	УстановитьПривилегированныйРежим(Истина);
	
		ОбъектМосква = ГородМосква.ПолучитьОбъект();
		ОбластьШирота = ОбластьМосква.ПолучитьОбласть("Широта");
		ОбъектМосква.Широта = Число(ОбластьШирота.Область(1,1).Текст);
		ОбластьДолгота = ОбластьМосква.ПолучитьОбласть("Долгота");
		ОбъектМосква.Долгота = Число(ОбластьДолгота.Область(1,1).Текст);
		ОбъектМосква.НачальноеЗаполнение = Истина;
		ОбъектМосква.Записать();
		
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

Процедура ЗаполнитьПредопределенныеСервисы() Экспорт
	
	СервисЯндекс = ПредопределенноеЗначение("Справочник.Сервисы.OpenWeather");
	
	Если СервисЯндекс.НачальноеЗаполнение Тогда
		Возврат;
	КонецЕсли; 
	
	ПреднастроенныеСервисы = ПолучитьОбщийМакет("ПреднастроенныеСервисы");
	ОбластьЯндексПогода = ПреднастроенныеСервисы.ПолучитьОбласть("OpenWeather");
	
	УстановитьПривилегированныйРежим(Истина);
	
		ОбъектЯндексПогода = СервисЯндекс.ПолучитьОбъект();
		ОбластьСтрокаЗапроса = ОбластьЯндексПогода.ПолучитьОбласть("СтрокаЗапроса");
		ОбъектЯндексПогода.СтрокаЗапроса = ОбластьСтрокаЗапроса.Область(1,1).Текст;
		
		ОбластьПараметрыЗапроса = ОбластьЯндексПогода.Области.ПараметрыЗапроса;
		
		Для НомерСтр = ОбластьПараметрыЗапроса.Верх По ОбластьПараметрыЗапроса.Низ Цикл
			СтрокаПараметров = ОбъектЯндексПогода.ПараметрыЗапроса.Добавить();
			СтрокаПараметров.ИмяПараметра = ОбластьЯндексПогода.Область(НомерСтр, 1).Текст;
			СтрокаПараметров.ЗначениеПараметра = ОбластьЯндексПогода.Область(НомерСтр, 2).Текст;
			ТекстТипаЗаголовкаЗапроса = ОбластьЯндексПогода.Область(НомерСтр, 3).Текст;
			Если ТекстТипаЗаголовкаЗапроса <> "" Тогда
				СтрокаПараметров.ТипПараметра = ПредопределенноеЗначение("Перечисление.ТипыЗаголовковЗапроса."+ТекстТипаЗаголовкаЗапроса);
			КонецЕсли; 
		КонецЦикла;
		
		ОбластьЗаголовкиЗапроса = ОбластьЯндексПогода.Области.ЗаголовкиЗапроса;
		
		Для НомерСтр = ОбластьЗаголовкиЗапроса.Верх По ОбластьЗаголовкиЗапроса.Низ Цикл
			СтрокаЗаголовков = ОбъектЯндексПогода.ЗаголовкиЗапроса.Добавить();
			СтрокаЗаголовков.ИмяЗаголовка = ОбластьЯндексПогода.Область(НомерСтр, 1).Текст;
			СтрокаЗаголовков.ЗначениеЗаголовка = ОбластьЯндексПогода.Область(НомерСтр, 2).Текст;
			ТекстТипаЗаголовкаЗапроса = ОбластьЯндексПогода.Область(НомерСтр, 3).Текст;
			Если ТекстТипаЗаголовкаЗапроса <> "" Тогда
				СтрокаЗаголовков.ТипПараметра = ПредопределенноеЗначение("Перечисление.ТипыЗаголовковЗапроса."+ТекстТипаЗаголовкаЗапроса);
			КонецЕсли; 
		КонецЦикла;
		
		ОбластьПутьКТемпературе = ОбластьЯндексПогода.ПолучитьОбласть("ПутьКТемпературе");
		ОбъектЯндексПогода.ПутьКТемпературе = ОбластьПутьКТемпературе.Область(1,1).Текст;
		ОбъектЯндексПогода.НачальноеЗаполнение = Истина;
		ОбъектЯндексПогода.Записать();
		
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры
