&НаСервере
Процедура ОбновитьПогодуНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Температура = СервисыПогоды.ВернутьТемпературу(ОбработкаОбъект.НаселенныйПункт, ОбработкаОбъект.Сервис);
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.Показатели;
	//СтруктураНаименованияНаселенногоПункта = СервисыПогоды.ЗначенияРеквизитовОбъекта(Объект.НаселенныйПункт, "Наименование");

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПогоду(Команда)
	
	ОбновитьПогодуНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.НаселенныйПункт = ПредопределенноеЗначение("Справочник.НаселенныеПункты.Москва");
	Объект.Сервис = ПредопределенноеЗначение("Справочник.Сервисы.OpenWeather");
	ОбновитьПогодуНаСервере();

КонецПроцедуры
